{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "batch_input_shape": [null, 28, 28, 1], "use_bias": true, "activity_regularizer": null, "trainable": true, "strides": [1, 1], "filters": 32, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "use_bias": true, "kernel_constraint": null, "units": 128, "bias_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_2", "seed": null, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "use_bias": true, "kernel_constraint": null, "units": 10, "bias_regularizer": null, "trainable": true}}], "backend": "tensorflow", "keras_version": "2.1.6"}